Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 VUs)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "FoodReach API Performance Suite"
    flow:
      - get:
          url: "/health"
      - get:
          url: "/api/ai/freshness?foodType=Cooked%20Food&preparationTime=2026-07-23T12:00:00Z&temperature=29"
      - post:
          url: "/api/ai/recommend-ngos"
          json:
            latitude: 28.6304
            longitude: 77.2177
            foodType: "Cooked Food"
            quantity: 40
      - get:
          url: "/api/ai/demand"
