Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm-up Phase
    - duration: 60
      arrivalRate: 20
      name: Sustained Load Phase
    - duration: 30
      arrivalRate: 50
      name: High Traffic Peak Phase
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health and Public API Performance"
    flow:
      - get:
          url: "/health"
      - post:
          url: "/api/location/distance"
          json:
            lat1: 12.9716
            lon1: 77.5946
            lat2: 12.9352
            lon2: 77.6245
